'''
12月份衣服销售
'''

#打印
print('*****************************************')
print('            12月份衣服销售信息             ')
print('日期 服装名称   价格/件  库存信息   销售量/每日')
print('1号  羽绒服    253.6   500       10')
print('2号  牛仔裤    86.3    600       60')
print('3号  风衣      96.8    335       43')
print('4号  皮草      135.9   855       63')
print('5号  T恤       65.8    632      63')
print('6号  衬衫      49.3    562      120')
print('7号  牛仔裤     86.3    600      72')
print('8号  羽绒服    253.6    500      69')
print('9号  牛仔裤    86.3     600      35')
print('10号 羽绒服    253.6    500      140')
print('11号 牛仔裤    86.3     600      90')
print('12号 皮草      135.9    855      24')
print('13号 T恤       65.8    632      45')
print('14号 风衣      96.8     335      25')
print('15号 牛仔裤    86.3     600      60')
print('16号 T恤       65.8    632      129')
print('17号 羽绒服    253.6    500      10')
print('18号 风衣      96.8     335     43')
print('19号 T恤       65.8    632      63')
print('20号 牛仔裤    86.3     600      60')
print('21号 皮草      135.9   855      63')
print('22号 风衣      96.8    335      60')
print('23号 T恤       65.8    632      58')
print('24号 牛仔裤    86.3     600     140')
print('25号 T恤      65.8     632     48')
print('26号 风衣      96.8    335      43')
print('27号 皮草      135.9   855      57')
print('28号 羽绒服    253.6    500     10')
print('29号 T恤      65.8     632     63')
print('30号 风衣     96.8     335     78 ')

a=(10+69+140+10+10)#羽绒服12月份销售总量,单价253.6
b=(60+72+35+90+60+60+140)#牛仔裤12月份销售总量，单价86.3
c=(43+25+43+60+43+78)#风衣12月份销售总量，单价96.8
d=(63+24+63+57)#皮草12月份销售总量，单价135.9
e=(63+45+129+63+58+48+63)#T恤12月份销售总量，单价65.8
f=(120)#衬衫12月份销售总量，单价49.3
g=(a+b+c+d+e+f)
A=(253.6*a+86.3*b+96.8*c+135.9*d+65.8*e+49.3*f)#12月份衣服销售总额
B=((a+b+c+d+e+f)/30)
C=(a/g)
print('12月份销售总额为：',round(A,2))
print('12月份平均每日销售数量为：',round(B,2))
print('12月份羽绒服月销售量占比为:{:.0%}'.format(a/g))
print('12月份牛仔裤月销售量占比为:{:.0%}'.format(b/g))
print('12月份风衣月销售量占比为:{:.0%}'.format(c/g))
print('12月份皮草月销售量占比为:{:.0%}'.format(d/g))
print('12月份T恤月销售量占比为:{:.0%}'.format(e/g))
print('12月份衬衫月销售量占比为:{:.0%}'.format(f/g))
